{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input0",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "name": "input0",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input0"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.00.8025200033400405",
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input0",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.00.8025200033400405"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.10.3480820013463424",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.00.8025200033400405",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.3480820013463424"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.20.9408559340232956",
            "padding": "valid",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.3480820013463424",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.20.9408559340232956"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.3.squeeze0.09174539549866711",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.20.9408559340232956",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.squeeze0.09174539549866711"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.3.squeeze_activation0.5676173063070546",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.squeeze0.09174539549866711",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.squeeze_activation0.5676173063070546"
        },
        {
          "class_name": "ZeroPadding2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.3.expand3x30.0842226020520157_pad",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.squeeze_activation0.5676173063070546",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.expand3x30.0842226020520157_pad"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.3.expand1x10.31478689690583417",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.squeeze_activation0.5676173063070546",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.expand1x10.31478689690583417"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.3.expand3x30.0842226020520157",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.expand3x30.0842226020520157_pad",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.expand3x30.0842226020520157"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.3.expand1x1_activation0.4571926262860374",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.expand1x10.31478689690583417",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.expand1x1_activation0.4571926262860374"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.3.expand3x3_activation0.47041688956719885",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.expand3x30.0842226020520157",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.3.expand3x3_activation0.47041688956719885"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": 3,
            "name": "features.30.36326081461478843",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.3.expand1x1_activation0.4571926262860374",
                0,
                0,
                {}
              ],
              [
                "features.3.expand3x3_activation0.47041688956719885",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.30.36326081461478843"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.4.squeeze0.37905165664091134",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.30.36326081461478843",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.squeeze0.37905165664091134"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.4.squeeze_activation0.6567730122468374",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.squeeze0.37905165664091134",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.squeeze_activation0.6567730122468374"
        },
        {
          "class_name": "ZeroPadding2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.4.expand3x30.5892414484719257_pad",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.squeeze_activation0.6567730122468374",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.expand3x30.5892414484719257_pad"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.4.expand1x10.9464907311300413",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.squeeze_activation0.6567730122468374",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.expand1x10.9464907311300413"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.4.expand3x30.5892414484719257",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.expand3x30.5892414484719257_pad",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.expand3x30.5892414484719257"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.4.expand1x1_activation0.4601327044802038",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.expand1x10.9464907311300413",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.expand1x1_activation0.4601327044802038"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.4.expand3x3_activation0.2020935201707541",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.expand3x30.5892414484719257",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.4.expand3x3_activation0.2020935201707541"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": 3,
            "name": "features.40.2812806378319477",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.4.expand1x1_activation0.4601327044802038",
                0,
                0,
                {}
              ],
              [
                "features.4.expand3x3_activation0.2020935201707541",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.40.2812806378319477"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.50.6865234552125186",
            "padding": "valid",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.40.2812806378319477",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.50.6865234552125186"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.6.squeeze0.5680096721257554",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.50.6865234552125186",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.squeeze0.5680096721257554"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.6.squeeze_activation0.7533554226706514",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.squeeze0.5680096721257554",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.squeeze_activation0.7533554226706514"
        },
        {
          "class_name": "ZeroPadding2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.6.expand3x30.768299468507894_pad",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.squeeze_activation0.7533554226706514",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.expand3x30.768299468507894_pad"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.6.expand1x10.7197790288522986",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.squeeze_activation0.7533554226706514",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.expand1x10.7197790288522986"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.6.expand3x30.768299468507894",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.expand3x30.768299468507894_pad",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.expand3x30.768299468507894"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.6.expand1x1_activation0.21745254969405514",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.expand1x10.7197790288522986",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.expand1x1_activation0.21745254969405514"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.6.expand3x3_activation0.834312692255158",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.expand3x30.768299468507894",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.6.expand3x3_activation0.834312692255158"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": 3,
            "name": "features.60.024490162238330226",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.6.expand1x1_activation0.21745254969405514",
                0,
                0,
                {}
              ],
              [
                "features.6.expand3x3_activation0.834312692255158",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.60.024490162238330226"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.7.squeeze0.8502917177140493",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.60.024490162238330226",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.squeeze0.8502917177140493"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.7.squeeze_activation0.46897157210628715",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.squeeze0.8502917177140493",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.squeeze_activation0.46897157210628715"
        },
        {
          "class_name": "ZeroPadding2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.7.expand3x30.239302265432066_pad",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.squeeze_activation0.46897157210628715",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.expand3x30.239302265432066_pad"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.7.expand1x10.2889866017724274",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.squeeze_activation0.46897157210628715",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.expand1x10.2889866017724274"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.7.expand3x30.239302265432066",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.expand3x30.239302265432066_pad",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.expand3x30.239302265432066"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.7.expand1x1_activation0.11958095429185545",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.expand1x10.2889866017724274",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.expand1x1_activation0.11958095429185545"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.7.expand3x3_activation0.787705918411159",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.expand3x30.239302265432066",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.7.expand3x3_activation0.787705918411159"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": 3,
            "name": "features.70.2786763601341865",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.7.expand1x1_activation0.11958095429185545",
                0,
                0,
                {}
              ],
              [
                "features.7.expand3x3_activation0.787705918411159",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.70.2786763601341865"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.80.7994833216241273",
            "padding": "valid",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.70.2786763601341865",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.80.7994833216241273"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 48,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.9.squeeze0.9489057972730339",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.80.7994833216241273",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.squeeze0.9489057972730339"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.9.squeeze_activation0.8363984295305551",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.squeeze0.9489057972730339",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.squeeze_activation0.8363984295305551"
        },
        {
          "class_name": "ZeroPadding2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.9.expand3x30.9353653847690785_pad",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.squeeze_activation0.8363984295305551",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.expand3x30.9353653847690785_pad"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 256,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.9.expand1x10.23288780686590405",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.squeeze_activation0.8363984295305551",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.expand1x10.23288780686590405"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 256,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.9.expand3x30.9353653847690785",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.expand3x30.9353653847690785_pad",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.expand3x30.9353653847690785"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.9.expand1x1_activation0.329424461276269",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.expand1x10.23288780686590405",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.expand1x1_activation0.329424461276269"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.9.expand3x3_activation0.4022004365332953",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.expand3x30.9353653847690785",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.9.expand3x3_activation0.4022004365332953"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": 3,
            "name": "features.90.997340890740579",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.9.expand1x1_activation0.329424461276269",
                0,
                0,
                {}
              ],
              [
                "features.9.expand3x3_activation0.4022004365332953",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.90.997340890740579"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.10.squeeze0.9256594128437959",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.90.997340890740579",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.squeeze0.9256594128437959"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.10.squeeze_activation0.5576997379972822",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.squeeze0.9256594128437959",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.squeeze_activation0.5576997379972822"
        },
        {
          "class_name": "ZeroPadding2D",
          "config": {
            "data_format": "channels_last",
            "name": "features.10.expand3x30.037528108703965724_pad",
            "padding": [
              [
                1,
                1
              ],
              [
                1,
                1
              ]
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.squeeze_activation0.5576997379972822",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.expand3x30.037528108703965724_pad"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 256,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "features.10.expand1x10.4343905680939111",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.squeeze_activation0.5576997379972822",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.expand1x10.4343905680939111"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 256,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "features.10.expand3x30.037528108703965724",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.expand3x30.037528108703965724_pad",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.expand3x30.037528108703965724"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.10.expand1x1_activation0.31523025369445357",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.expand1x10.4343905680939111",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.expand1x1_activation0.31523025369445357"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "features.10.expand3x3_activation0.11309929310358069",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.expand3x30.037528108703965724",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.10.expand3x3_activation0.11309929310358069"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": 3,
            "name": "features.100.47549596086886536",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.10.expand1x1_activation0.31523025369445357",
                0,
                0,
                {}
              ],
              [
                "features.10.expand3x3_activation0.11309929310358069",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "features.100.47549596086886536"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "classifier.00.5817253391875224",
            "noise_shape": null,
            "rate": 0.5,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "features.100.47549596086886536",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "classifier.00.5817253391875224"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 2,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "classifier.10.8932952191924111",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "classifier.00.5817253391875224",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "classifier.10.8932952191924111"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "classifier.20.39639537491275056",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "classifier.10.8932952191924111",
